{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "risk_management",
    "1": "data_governance",
    "2": "technical_documentation",
    "3": "record_keeping",
    "4": "transparency",
    "5": "human_oversight",
    "6": "security",
    "7": "unrelated"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "data_governance": 1,
    "human_oversight": 5,
    "record_keeping": 3,
    "risk_management": 0,
    "security": 6,
    "technical_documentation": 2,
    "transparency": 4,
    "unrelated": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31102
}
